/*
*Од стандарден влез се читаат знаци се додека не се прочита извичник. Во вака внесениот текст се скриени цели броеви
(помали од 100). Да се напише програма што ќе ги прочита сите знаци и на излез ќе го испечати збирот на сите броеви
скриени во текстот.
Напомена: cin во C++ ги игнорира празните места (space). За да не ги игнорира потребно е да се додаде noskipws
пред читањето на знакот (пр. cin >> noskipws >> znak;)
 */
#include <iostream>
#include <cctype>
using namespace std;

int main() {
    char znak;
    int sum = 0;
    int num = 0;

    while (cin >> noskipws >> znak) {

        if (znak == '!') break;

        if (isdigit(znak)) {
            num = num * 10 + (znak - '0');//бројот што го градиме
        } else {
            sum += num;
            num = 0;
        }
    }
    /*Ако текстот завршува со број, на пример:
  abc12!
  Циклусот ќе чита '1' и '2', num = 12.
  Но кога ќе се прочита '!', влегуваш во if (znak == '!') break; и никогаш не го додаваш последниот број (num) во sum.
  💡 Значи, последниот број се губи ако текстот завршува директно со !.,бидејќи во if го градиш,а го додаваш
  //во else ,т.е кога наидуваш на нешто што не е број,од таа причина бидејќи  if (znak == '!') break;
  одма го прекинува while циклусот и не се извршува ништо подолу затоа надвор од while правиме sum+=num
   */
    sum += num;

    cout << sum << endl;
}
